Revit 2026 API

# RebarContainerParameterManagerAddSharedParameterAsOverride Method

---

Adds a shared parameter as one of the parameter overrides stored by this Rebar Container element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSharedParameterAsOverride(
	ElementId paramId
)
```
```vb
Public Sub AddSharedParameterAsOverride (
	paramId As ElementId
)
```
```cpp
public:
void AddSharedParameterAsOverride(
	ElementId^ paramId
)
```
```fsharp
member AddSharedParameterAsOverride :
        paramId : ElementId -> unit
```

#### Parameters

paramId ElementId
     The id of the shared parameter element

| Exception | Condition |
| --- | --- |
| ArgumentException | paramId is not a valid Element identifier. -or- paramId is not the id of a shared parameter in the current document, or its name was already used by another shared parameter of the element. -or- paramId is already a Rebar Container parameter |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarContainerParameterManager Class

Autodesk.Revit.DB.Structure Namespace